Routes_Controller/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Color Painting"], ["image_url", "colorpainting.com"], ["artist_id", 1], ["created_at", "2022-11-10 22:17:07.332346"], ["updated_at", "2022-11-10 22:17:07.332346"]]
---
    def create
        # render json: params
        # user = User.new(params.require(:user).permit(:name, :email))
        # # replace the `user_attributes_here` with the actual attribute keys
        # user.save!
        # render json: user
        artwork = Artwork.new(artwork_param)

        if artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Colors"], ["updated_at", "2022-11-10 22:18:01.721069"], ["id", 4]]
---
    def update
        artwork = Artwork.find_by(id: params[:id])
        if artwork.update(artwork_param)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]
---
    def destroy
        artwork = Artwork.find_by(id: params[:id])
        artwork.destroy