Routes_Controller/app/controllers/comments_controller.rb

    def index
        user = User.find_by(id: params[:user_id])
        artwork = Artwork.find_by(id: params[:artwork_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]