Routes_Controller/app/controllers/users_controller.rb

    def index
        if params[:query]
            user = User.select('*').where('username = (?)', params[:query])
            render json: user
        else
            user = User.all
---
SELECT "users".* FROM "users"

    def create
        # render json: params
        # user = User.new(params.require(:user).permit(:name, :email))
        # # replace the `user_attributes_here` with the actual attribute keys
        # user.save!
        # render json: user
        user = User.new(user_param)

        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ronaldo"], ["email", "ronaldo@gmail"], ["created_at", "2022-11-10 18:17:51.980067"], ["updated_at", "2022-11-10 18:17:51.980067"]]

    def update
        user = User.find_by(id: params[:id])
        if user.update(user_param)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "messi"], ["updated_at", "2022-11-10 18:27:59.686219"], ["id", 2]]