Routes_Controller/app/controllers/users_controller.rb

    def update
        user = User.find_by(params[:id])
---
SELECT "users".* FROM "users" WHERE (2) LIMIT $1  [["LIMIT", 1]]